SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_i2s.c
    i2s->state = HAL_I2S_STATE_BUSY;
    i2s->periph = periph;  
    /* disable the peripheral */
    spi_disable(periph);
    /* init I2S */
    i2s_init(periph,p_init->mode,p_init->standard,p_init->ckpl);
    i2s_psc_config(periph,p_init->audiosample,p_init->frameformat,p_init->mckout);
    
    i2s->state = HAL_I2S_STATE_READY;

    return HAL_ERR_NONE;
}

/*!
    \brief      I2S transmit in polling mode
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  timeout_ms: timeout duration 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_VAL, details refer to gd32e23x_hal.h 
*/
int32_t hal_i2s_transmit_poll(hal_i2s_dev_struct *i2s, uint16_t *p_buffer, uint16_t length, uint32_t timeout_ms)
{
    __IO uint32_t tmp = 0x0U;
    uint32_t tmp1 = 0U;
    uint32_t tick_start = 0;
#if (1 == HAL_PARAMETER_CHECK)
    /* check input parameter */
    if((NULL == p_buffer) || (0U == length)){
        return HAL_ERR_VAL;
    }
#endif /* 1 == HAL_PARAMETER_CHECK */
    if(HAL_I2S_STATE_READY == i2s->state){
        tmp1 = SPI_I2SCTL(i2s->periph)&((SPI_I2SCTL_DTLEN | SPI_I2SCTL_CHLEN));
        /* check I2S frameformat */
        if((I2S_FRAMEFORMAT_DT24B_CH32B == tmp1) || (I2S_FRAMEFORMAT_DT32B_CH32B == tmp1)){
            i2s->txbuffer.length= (length << 1U);
            i2s->txbuffer.pos= (length << 1U);
        }else{
            i2s->txbuffer.length= length;
            i2s->txbuffer.pos= length;
        }

        i2s->error_code = HAL_I2S_ERROR_NONE;
        i2s->state = HAL_I2S_STATE_BUSY_TX;

        /* enable I2S peripheral */
        i2s_enable(i2s->periph);

        /* transmit data */
        while(i2s->txbuffer.pos > 0U){
            SPI_DATA(i2s->periph) = (*p_buffer++);
            i2s->txbuffer.pos--;

            /* wait TBE flag is set */
            tick_start = hal_basetick_count_get();
            while(RESET == spi_i2s_flag_get(i2s->periph, I2S_FLAG_TBE)){
                if(HAL_TIMEOUT_FOREVER != timeout_ms){
                    if(SET == hal_basetick_timeout_check(tick_start,timeout_ms)){
                        return HAL_ERR_TIMEOUT;
                    }            
                }
            }
           if(SET == spi_i2s_flag_get(i2s->periph, I2S_FLAG_TXURERR)){
               /* clear underrun flag */
               tmp = SPI_STAT((i2s)->periph);

               i2s->state = HAL_I2S_STATE_READY;
               i2s->error_code = HAL_I2S_ERROR_UNDERRUN;
               return HAL_ERR_HARDWARE;
            }
        }
        i2s->state = HAL_I2S_STATE_READY;

        return HAL_ERR_NONE;
    }else{
        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      I2S receive in polling mode
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  timeout_ms: timeout duration 
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h 
*/
int32_t hal_i2s_receive_poll(hal_i2s_dev_struct *i2s, uint16_t *p_buffer, uint16_t length, uint32_t timeout_ms)
{
    uint32_t tmp1 = 0U;
    __IO uint32_t tmp = 0x00U;
    uint32_t tick_start = 0;
#if (1 == HAL_PARAMETER_CHECK)
    /* check input parameter */
    if((NULL == p_buffer) || (0U == length)){
        return HAL_ERR_VAL;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    if(HAL_I2S_STATE_READY == i2s->state){
        /* check I2S frameformat */
        tmp1 = SPI_I2SCTL(i2s->periph)&(SPI_I2SCTL_DTLEN| SPI_I2SCTL_CHLEN);
        if((tmp1 == I2S_FRAMEFORMAT_DT24B_CH32B) || (tmp1 == I2S_FRAMEFORMAT_DT32B_CH32B)){
            i2s->rxbuffer.length = (length << 1U);
            i2s->rxbuffer.pos = (length << 1U);
        }else{
            i2s->rxbuffer.length = length;
            i2s->rxbuffer.pos = length;
        }

        i2s->error_code = HAL_ERR_NONE;
        i2s->state = HAL_I2S_STATE_BUSY_RX;

        if(SPI_I2SCTL_I2SEN != (SPI_I2SCTL(i2s->periph) &SPI_I2SCTL_I2SEN)){
            /* enable I2S peripheral */
            i2s_enable(i2s->periph);
        }

        /* receive data */
        while(i2s->rxbuffer.pos > 0U){
            tick_start = hal_basetick_count_get();
            while(RESET == spi_i2s_flag_get(i2s->periph, I2S_FLAG_RBNE)){
                if(HAL_TIMEOUT_FOREVER != timeout_ms){
                    if(SET == hal_basetick_timeout_check(tick_start,timeout_ms)){
                        return HAL_ERR_TIMEOUT;
                    }            
                }
            }

            if(SET == spi_i2s_flag_get(i2s->periph, I2S_FLAG_RXORERR)){
                /* clear overrun error */
                 tmp = SPI_DATA(i2s->periph);
                 tmp = SPI_STAT(i2s->periph);
                /* set the I2S state ready */
                i2s->state = HAL_I2S_STATE_READY;
                i2s->error_code = HAL_I2S_ERROR_OVERRUN;
                return HAL_ERR_HARDWARE;
            }

            (*p_buffer++) = SPI_DATA(i2s->periph);
            i2s->rxbuffer.pos--;
        }

        i2s->state = HAL_I2S_STATE_READY;
        return HAL_ERR_NONE;
    }else{
        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      I2S transmit in interrupt mode
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h 
*/
int32_t hal_i2s_transmit_interrupt(hal_i2s_dev_struct *i2s, uint16_t *p_buffer, uint16_t length, hal_i2s_user_callback_struct *p_user_func)
{
    uint32_t tmp1 = 0U;
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == p_buffer) || (0U == length)){
        return HAL_ERR_VAL;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    if(i2s->state == HAL_I2S_STATE_READY){
        i2s->txbuffer.buffer = p_buffer;
        /* check I2S frameformat */
        tmp1 = SPI_I2SCTL(i2s->periph)&(SPI_I2SCTL_DTLEN| SPI_I2SCTL_CHLEN);

