SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_i2s.c
        if((I2S_FRAMEFORMAT_DT24B_CH32B == tmp1) || (I2S_FRAMEFORMAT_DT32B_CH32B == tmp1)){
            i2s->txbuffer.length= (length << 1U);
            i2s->txbuffer.pos= (length << 1U);
        }else{
            i2s->txbuffer.length= length;
            i2s->txbuffer.pos= length;
        }
        i2s->i2s_irq.transmit_handler = _i2s_transmit_interrupt;
        i2s->tx_callback = (void *)p_user_func->complete_func;
        i2s->error_callback = (void *)p_user_func->error_func;
        
        i2s->state = HAL_I2S_STATE_BUSY_TX;

        /* enable TBE and ERR interrupt */
        spi_i2s_interrupt_enable(i2s->periph,SPI_I2S_INT_TBE);
        spi_i2s_interrupt_enable(i2s->periph,SPI_I2S_INT_ERR);
        
        if(SPI_I2SCTL_I2SEN != (SPI_I2SCTL(i2s->periph) &SPI_I2SCTL_I2SEN)){
            /* enable I2S peripheral */
            i2s_enable(i2s->periph);
        }
        return HAL_ERR_NONE;
    }else{
        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      I2S receive in interrupt mode
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_VAL, details refer to gd32e23x_hal.h 
*/
int32_t hal_i2s_receive_interrupt(hal_i2s_dev_struct *i2s, uint16_t *p_buffer, uint16_t length, hal_i2s_user_callback_struct *p_user_func)
{
    uint32_t tmp1 = 0U;
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == p_buffer) || (0U == length)){
        return HAL_ERR_VAL;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    
    if(i2s->state == HAL_I2S_STATE_READY){
        i2s->rxbuffer.buffer = p_buffer;
        /* check I2S frameformat */
        tmp1 = SPI_I2SCTL(i2s->periph)&(SPI_I2SCTL_DTLEN | SPI_I2SCTL_CHLEN);

        if((I2S_FRAMEFORMAT_DT24B_CH32B == tmp1) || (I2S_FRAMEFORMAT_DT32B_CH32B == tmp1)){
            i2s->rxbuffer.length= (length << 1U);
            i2s->rxbuffer.pos= (length << 1U);
        }else{
            i2s->rxbuffer.length= length;
            i2s->rxbuffer.pos= length;
        }

        i2s->i2s_irq.receive_handler = _i2s_receive_interrupt;
        i2s->rx_callback = (void *)p_user_func->complete_func;
        i2s->error_callback = (void *)p_user_func->error_func;
        i2s->state     = HAL_I2S_STATE_BUSY_RX;

        /* enable RBNE and ERR interrupt */
        spi_i2s_interrupt_enable(i2s->periph,SPI_I2S_INT_RBNE);
        spi_i2s_interrupt_enable(i2s->periph,SPI_I2S_INT_ERR);

        if(SPI_I2SCTL_I2SEN != (SPI_I2SCTL(i2s->periph) &SPI_I2SCTL_I2SEN)){
            /* enable I2S peripheral */
            i2s_enable(i2s->periph);
        }
        return HAL_ERR_NONE;
    }else{
        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      I2S transmit in DMA mode
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to txbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_VAL, details refer to gd32e23x_hal.h 
*/
int32_t hal_i2s_transmit_dma(hal_i2s_dev_struct *i2s, uint16_t *p_buffer, uint16_t length, hal_i2s_user_callback_struct *p_user_func)
{
    uint32_t *p_tmp = NULL;
    uint32_t tmp1 = 0U;
    hal_dma_irq_struct dma_irq;
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == p_buffer) || (0U == length)){
        return HAL_ERR_VAL;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    if(HAL_I2S_STATE_READY == i2s->state){
        i2s->txbuffer.buffer = p_buffer;
        /* check I2S frameformat */
        tmp1 = SPI_I2SCTL(i2s->periph)&(SPI_I2SCTL_DTLEN| SPI_I2SCTL_CHLEN);
        if((I2S_FRAMEFORMAT_DT24B_CH32B == tmp1) || (I2S_FRAMEFORMAT_DT32B_CH32B == tmp1)){
            i2s->txbuffer.length = (length << 1U);
            i2s->txbuffer.pos = (length << 1U);
        }else{
            i2s->txbuffer.length = length;
            i2s->txbuffer.pos = length;
        }
        i2s->state = HAL_I2S_STATE_BUSY_TX;
        /* I2S callback function */
        i2s->tx_callback = (void *)p_user_func->complete_func;
        i2s->error_callback = (void *)p_user_func->error_func;
        
        /* I2S DMA transmit info*/
        hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);
        dma_irq.half_finish_handle = NULL;
        dma_irq.full_finish_handle = _i2s_transmit_complete_dma;
        dma_irq.error_handle = _i2s_dma_error;
        p_tmp = (uint32_t*)&p_buffer;
        hal_dma_start_interrupt(i2s->p_dma_tx,*(uint32_t*)p_tmp, (uint32_t)&SPI_DATA(i2s->periph), length, &dma_irq);

        /* enable I2S peripheral */
        i2s_enable(i2s->periph);

        /* enable transmit DMA request */
        spi_dma_enable(i2s->periph,SPI_DMA_TRANSMIT);
                
        return HAL_ERR_NONE;
    }else{
        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      I2S receive in DMA mode
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_buffer: pointer to rxbuffer 
    \param[in]  length: length of data to be sent 
    \param[in]  p_user_func: pointer to call back function for user
    \param[out] none
    \retval     error code: HAL_ERR_NONE, HAL_ERR_VAL details refer to gd32e23x_hal.h 
*/
int32_t hal_i2s_receive_dma(hal_i2s_dev_struct *i2s, uint16_t *p_buffer, uint16_t length, hal_i2s_user_callback_struct *p_user_func)
{
    uint32_t *p_tmp = NULL;
    __IO uint32_t tmp1 = 0U;
    hal_dma_irq_struct dma_irq;
#if (1 == HAL_PARAMETER_CHECK)
    if((NULL == p_buffer) || (0U == length)){
        return  HAL_ERR_VAL;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    if(HAL_I2S_STATE_READY == i2s->state){
        i2s->rxbuffer.buffer = p_buffer;
        /* check I2S frameformat */
        tmp1 = SPI_I2SCTL(i2s->periph)&(SPI_I2SCTL_DTLEN| SPI_I2SCTL_CHLEN);

