SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_i2s.c
        if((I2S_FRAMEFORMAT_DT24B_CH32B == tmp1) || (I2S_FRAMEFORMAT_DT32B_CH32B == tmp1)){
            i2s->rxbuffer.length = (length << 1U);
            i2s->rxbuffer.pos = (length << 1U);
        }else{
            i2s->rxbuffer.length = length;
            i2s->rxbuffer.pos = length;
        }

        i2s->state = HAL_I2S_STATE_BUSY_RX;

        /* I2S callback function */
        i2s->rx_callback = (void *)p_user_func->complete_func;
        i2s->error_callback = (void *)p_user_func->error_func;

        /* I2S DMA receive info*/
        hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);
        dma_irq.half_finish_handle = NULL;
        dma_irq.full_finish_handle = _i2s_receive_complete_dma;
        dma_irq.error_handle = _i2s_dma_error;
        p_tmp = (uint32_t*)&p_buffer;
        hal_dma_start_interrupt(i2s->p_dma_rx, (uint32_t)&SPI_DATA(i2s->periph),*(uint32_t*)p_tmp, length, &dma_irq);

        i2s_enable(i2s->periph);
        /* enable receive DMA request */
        spi_dma_enable(i2s->periph,SPI_DMA_RECEIVE);

        return HAL_ERR_NONE;
    }else{
        return HAL_ERR_BUSY;
    }
}

/*!
    \brief      pause I2S DMA
    \param[in]  i2s: i2s device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2s_dma_pause(hal_i2s_dev_struct *i2s)
{
    if(HAL_I2S_STATE_BUSY_TX == i2s->state){
        /* disable the I2S DMA transmit request */
        spi_dma_disable(i2s->periph,SPI_DMA_TRANSMIT);
    }else{
        if(HAL_I2S_STATE_BUSY_RX == i2s->state){
            /* disable the I2S DMA receive request */
            spi_dma_disable(i2s->periph,SPI_DMA_RECEIVE);
        }
    }
}

/*!
    \brief      resume I2S DMA
    \param[in]  i2s: i2s device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2s_dma_resume(hal_i2s_dev_struct *i2s)
{

    if(HAL_I2S_STATE_BUSY_TX == i2s->state){
        /* disable the I2S DMA transmit request */
        spi_dma_enable(i2s->periph,SPI_DMA_TRANSMIT);
    }else{
        if(HAL_I2S_STATE_BUSY_RX == i2s->state){
            /* disable the I2S DMA receive request */
            spi_dma_enable(i2s->periph,SPI_DMA_RECEIVE);
        }
    }            

    if(SPI_I2SCTL_I2SEN != (SPI_I2SCTL(i2s->periph) &SPI_I2SCTL_I2SEN)){
        /* enable I2S peripheral */
        i2s_enable(i2s->periph);
    }
}

/*!
    \brief      stop I2S DMA
    \param[in]  i2s: i2s device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2s_dma_stop(hal_i2s_dev_struct *i2s)
{

    if(HAL_I2S_STATE_BUSY_TX == i2s->state){
        /* disable the I2S DMA transmit request */
        spi_dma_disable(i2s->periph,SPI_DMA_TRANSMIT);

        /* disable the I2S DMA channel */
        hal_dma_stop(i2s->p_dma_tx );
    }else{
        if(HAL_I2S_STATE_BUSY_RX == i2s->state){
            /* disable the I2S DMA receive request */
            spi_dma_disable(i2s->periph,SPI_DMA_RECEIVE);

            /* disable the I2S DMA channel */
            hal_dma_stop(i2s->p_dma_rx );
        }
    }
    /* disable I2S peripheral */
    spi_disable(i2s->periph);
    i2s->state = HAL_I2S_STATE_READY;
}

/*!
    \brief      start I2S module
    \param[in]  i2s: i2s device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2s_start(hal_i2s_dev_struct *i2s)
{
    i2s_enable(i2s->periph);
}

/*!
    \brief      stop I2S module
    \param[in]  i2s: I2S device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2s_stop(hal_i2s_dev_struct *i2s)
{
    i2s_disable(i2s->periph);
}

/*!
    \brief      I2S interrupt handler content function
    \param[in]  i2s: I2S device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2s_irq(hal_i2s_dev_struct *i2s)
{
    __IO uint32_t tmp = 0x00U;
    hal_i2s_user_cb p_func;
    
    if(HAL_I2S_STATE_BUSY_RX == i2s->state){
        if(RESET != spi_i2s_interrupt_flag_get(i2s->periph, SPI_I2S_INT_FLAG_RBNE)){
            i2s->i2s_irq.receive_handler(i2s);
        }

        /* I2S overrun error interrupt occured */
        if(RESET != spi_i2s_interrupt_flag_get(i2s->periph, SPI_I2S_INT_FLAG_RXORERR)){
            /* disable RBNE and ERR interrupt */
            spi_i2s_interrupt_disable(i2s->periph, SPI_I2S_INT_RBNE);
            spi_i2s_interrupt_disable(i2s->periph, SPI_I2S_INT_ERR);

            /* clear overrun error */
            tmp = SPI_DATA(i2s->periph);
            tmp = SPI_STAT(i2s->periph);

            i2s->state = HAL_I2S_STATE_READY;
            /* set the error code and execute error callback */
            i2s->error_code = HAL_I2S_ERROR_OVERRUN;
            p_func = (hal_i2s_user_cb)i2s->error_callback;
            if(NULL != p_func){
                 p_func(i2s);
            }      
        }
    }

    if(HAL_I2S_STATE_BUSY_TX == i2s->state){
        if(RESET != spi_i2s_interrupt_flag_get(i2s->periph, SPI_I2S_INT_FLAG_TBE)){
            i2s->i2s_irq.transmit_handler(i2s);
        }

        /* I2S underrun error interrupt occurred */
        if(RESET != spi_i2s_interrupt_flag_get(i2s->periph, I2S_INT_FLAG_TXURERR)){
            /* disable TBE and ERR interrupt */
            spi_i2s_interrupt_disable(i2s->periph, SPI_I2S_INT_TBE);
            spi_i2s_interrupt_disable(i2s->periph, SPI_I2S_INT_ERR);

            /* clear underrun flag */
            tmp = SPI_STAT((i2s)->periph);

            i2s->state = HAL_I2S_STATE_READY;
            /* set the error code and execute error callback */
            i2s->error_code = HAL_I2S_ERROR_UNDERRUN;
            p_func = (hal_i2s_user_cb)i2s->error_callback;
            if(NULL != p_func){
                p_func(i2s);
            }  
        }
    }
}

/*!
    \brief      set user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: the structure that contains callback handlers of I2C interrupt
    \param[out] none
    \retval     none
*/
void hal_i2s_irq_handle_set(hal_i2s_dev_struct *i2s, hal_i2s_irq_struct *p_irq)
{
    if(NULL != p_irq->error_handle ){
        i2s->i2s_irq.error_handle = p_irq->error_handle;
        spi_i2s_interrupt_enable(i2s->periph, SPI_I2S_INT_ERR);
    }else{
        i2s->i2s_irq.error_handle = NULL;
        spi_i2s_interrupt_disable(i2s->periph, SPI_I2S_INT_ERR);
    }

