SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_i2s.c
    if(NULL != p_irq->receive_handler ){
        i2s->i2s_irq.receive_handler = p_irq->receive_handler;
        spi_i2s_interrupt_enable(i2s->periph, SPI_I2S_INT_RBNE);
    }else{
        i2s->i2s_irq.receive_handler = NULL;
        spi_i2s_interrupt_disable(i2s->periph, SPI_I2S_INT_RBNE);
    }
        
    if(NULL != p_irq->transmit_handler ){
        i2s->i2s_irq.transmit_handler = p_irq->transmit_handler;
        spi_i2s_interrupt_enable(i2s->periph, SPI_I2S_INT_TBE);
    }else{
        i2s->i2s_irq.transmit_handler = NULL;
        spi_i2s_interrupt_disable(i2s->periph, SPI_I2S_INT_TBE);
    }
}

/*!
    \brief      reset all user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  i2s: I2S device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_i2s_irq_handle_all_reset(hal_i2s_dev_struct *i2s)
{
     i2s->i2s_irq.error_handle=NULL;
     i2s->i2s_irq.transmit_handler = NULL;
     i2s->i2s_irq.receive_handler =NULL;
}

/*!
    \brief      I2S DMA transmit handler
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _i2s_transmit_complete_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_i2s_dev_struct *p_i2s;
    hal_i2s_user_cb p_func;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_i2s = (hal_i2s_dev_struct*)p_dma->p_periph;
    p_func = (hal_i2s_user_cb)p_i2s->tx_callback;
    /* DMA normal mode */
    if(SET != (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN )){
        spi_dma_disable(p_i2s->periph,SPI_DMA_TRANSMIT);
        p_i2s->txbuffer.length = 0;
        p_i2s->state = HAL_I2S_STATE_READY;
    }
    /* DMA transmit complete callback */
    if(NULL != p_func){
        p_func(p_i2s);
    }
}

/*!
    \brief      I2S DMA receive handler
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _i2s_receive_complete_dma(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_i2s_dev_struct *p_i2s;
    hal_i2s_user_cb p_func;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_i2s = (hal_i2s_dev_struct*)p_dma->p_periph;
    p_func = (hal_i2s_user_cb)p_i2s->rx_callback;
    /* DMA normal mode */
    if(SET != (DMA_CHCTL(p_dma->channel) & DMA_CHXCTL_CMEN )){
        spi_dma_disable(p_i2s->periph,SPI_DMA_RECEIVE);
        p_i2s->rxbuffer.length = 0;
        p_i2s->state = HAL_I2S_STATE_READY;
    }
    /* DMA receive complete callback */
    if(NULL != p_func){
        p_func(p_i2s);
    }
}

/*!
    \brief      I2S DMA communication error
    \param[in]  dma: DMA device information structrue
    \param[out] none
    \retval     none
*/
static void _i2s_dma_error(void * dma)
{
    hal_dma_dev_struct *p_dma;
    hal_i2s_dev_struct *p_i2s;
    hal_i2s_user_cb p_func;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_i2s = (hal_i2s_dev_struct*)p_dma->p_periph;
    p_func = (hal_i2s_user_cb)p_i2s->error_callback;

    /* disable SPI transmit and receive DMA */
    spi_dma_disable(p_i2s->periph,SPI_DMA_RECEIVE);
    spi_dma_disable(p_i2s->periph,SPI_DMA_TRANSMIT);
    p_i2s->txbuffer.length = 0;
    p_i2s->rxbuffer.length = 0;
    p_i2s->state = HAL_I2S_STATE_READY ;
    
    /* error callback */
    if(NULL != p_func){
        p_func(p_i2s);
    }
}

/*!
    \brief      I2S transmit interrupt handler
    \param[in]  i2s: I2S device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _i2s_transmit_interrupt(void *i2s)
{
    hal_i2s_dev_struct *p_i2s = i2s;
    hal_i2s_user_cb p_func = (hal_i2s_user_cb)p_i2s->tx_callback;
    /* transmit data */
    SPI_DATA(p_i2s->periph) = (*p_i2s->txbuffer.buffer++);
    p_i2s->txbuffer.pos--;

    if(0U == p_i2s->txbuffer.pos){
        /* disable TBE and ERR interrupt */
        spi_i2s_interrupt_disable(p_i2s->periph,SPI_I2S_INT_TBE );
        spi_i2s_interrupt_disable(p_i2s->periph,SPI_I2S_INT_ERR );        
        p_i2s->state = HAL_I2S_STATE_READY;
        
        if(NULL != p_func){
             p_func(p_i2s);
        }    
    }
}

/*!
    \brief      I2S receive interrupt handler
    \param[in]  i2s: I2S device information structure
                    the structure is not necessary to be reconfigured after structrue initialization,
                    the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _i2s_receive_interrupt(void *i2s)
{ 
    hal_i2s_dev_struct *p_i2s = i2s;
    hal_i2s_user_cb p_func = (hal_i2s_user_cb)p_i2s->rx_callback;

    /* receive data */
    (*p_i2s->rxbuffer.buffer++)= SPI_DATA(p_i2s->periph);
    p_i2s->rxbuffer.pos--;
    
    if(0U == p_i2s->rxbuffer.pos){
        /* disable RBNE and ERR interrupt */
        spi_i2s_interrupt_disable(p_i2s->periph,SPI_I2S_INT_RBNE );
        spi_i2s_interrupt_disable(p_i2s->periph,SPI_I2S_INT_ERR );

        p_i2s->state = HAL_I2S_STATE_READY;
        
        if(NULL != p_func){
            p_func(p_i2s);
        }
    }
}
